Tekla Open API Reference for Tekla Structures 2025
ClipPlane Properties
The ClipPlane type exposes the following members.
Properties
Name | Description
ClipPlaneID
 Gets the clip plane ID.
IsBorderVisible
Gets or sets a value indicating whether the clip plane border is visible.
IsScissorVisible
Gets or sets a value indicating whether the clip plane scissor icon is visible.
Location
The clip plane location in global coordinates (XYZ).
UpVector
The clip plane up vector in global coordinates (XYZ).
View
The view the clip plane belongs to.
Top
See Also
Reference
ClipPlane Class
Tekla.Structures.Model.UI Namespace